RASC186/lock-in-fw/Lock_in.cydsn/Generated_Source/PSoC6/DETECTOR_ADC.h
    /* Clock parameters*/
    #if (DETECTOR_ADC_CLOCK_INTERNAL)
        #define DETECTOR_ADC_CFG3_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (DETECTOR_ADC_CFG3_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (DETECTOR_ADC_CLOCK_INTERNAL) */
#endif /* (DETECTOR_ADC_TOTAL_CONFIGS > 3) */

/* ************************************************************************** */
/* End configuration 3 customizer defines                                     */
/* ************************************************************************** */

#define DETECTOR_ADC_DEFAULT_SAMPLE_MODE_SEL      (0u)
#define DETECTOR_ADC_FREERUNNING                  (1u)
#define DETECTOR_ADC_HARDWARESOC                  (1u)
#define DETECTOR_ADC_NEG_SEL_VSSA_KELVIN          (0x0uL)
#define DETECTOR_ADC_NEG_SEL_VREF                 (0x7uL)
#define DETECTOR_ADC_PWR_CTRL_VREF_NORMAL_PWR     (0x0uL)

/** DETECTOR_ADC_TOTAL_CHANNELS_NUM
* This constant represents the number of input channels available for scanning.
*/
#define DETECTOR_ADC_TOTAL_CHANNELS_NUM           (3u)

/*******************************************************************************
*    Variables with External Linkage
*******************************************************************************/
/**
* \addtogroup group_globals
* Globals are noted in the descriptions of the functions that use globals.
* They are marked with (R), (W), or (RW) noting whether the variable is read,
* write, or read/write.
* @{
*/

/** DETECTOR_ADC_initVar
* The DETECTOR_ADC_initVar variable is used to indicate
* initial configuration of this component. The variable is initialized to zero and
* set to 1 the first time DETECTOR_ADC_Start() is called. This allows for
* component initialization without reinitialization in all subsequent calls to the
* DETECTOR_ADC_Start() routine.
*
* If reinitialization of the component is required, then the DETECTOR_ADC_Init() function
* can be called before the DETECTOR_ADC_Start() or DETECTOR_ADC_Enable()
* functions.
*/
extern uint8_t DETECTOR_ADC_initVar;
extern uint8_t DETECTOR_ADC_selected;
extern uint32_t DETECTOR_ADC_currentConfig;

#define DETECTOR_ADC_INIT_VAR_INIT_FLAG     (0x01u)

extern const DETECTOR_ADC_CONFIG_STRUCT DETECTOR_ADC_allConfigs[DETECTOR_ADC_TOTAL_CONFIGS];

/* SysPm callback structure for deep sleep entry and exit.
 * Call the Cy_SysPm_RegisterCallback function with this
 * structure before calling Cy_SysPm_DeepSleep.
*/
extern cy_stc_syspm_callback_t DETECTOR_ADC_DeepSleepCallbackStruct;

/** @} globals */

/* ************************************************************************** */
/* *******************Global MUX_SWITCH0 Definitions ************************ */
/* ************************************************************************** */
#if(DETECTOR_ADC_CFG0_VNEG_INPUT_SEL == DETECTOR_ADC_NEG_SEL_VSSA_KELVIN)
    /* Do not connect VSSA to VMINUS when one channel in differential mode used */
    #if((DETECTOR_ADC_TOTAL_CHANNELS_NUM == 1u) && (DETECTOR_ADC_CFG0_SINGLE_PRESENT == 0u))
        #define DETECTOR_ADC_MUX_SWITCH0_INIT      0u
    #else    /* multiple channels or one single ended channel */
        #define DETECTOR_ADC_MUX_SWITCH0_INIT      1u
    #endif /* ((DETECTOR_ADC_TOTAL_CHANNELS_NUM == 1u) && (DETECTOR_ADC_CFG0_SINGLE_PRESENT == 0u)) */
#else
    #define DETECTOR_ADC_MUX_SWITCH0_INIT          0u
#endif /* DETECTOR_ADC_CFG0_VNEG_INPUT_SEL == DETECTOR_ADC_NEG_SEL_VSSA_KELVIN */

/* ************************************************************************** */
/* Begin configuration 0 calculated defines                                   */
/* ************************************************************************** */
#define DETECTOR_ADC_CFG0_SAMPLE_TIME01_INIT \
        ((DETECTOR_ADC_CFG0_APERTURE_TIME0 \
        << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos) \
        | (DETECTOR_ADC_CFG0_APERTURE_TIME1 \
        << SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos))

#define DETECTOR_ADC_CFG0_SAMPLE_TIME23_INIT \
        ((DETECTOR_ADC_CFG0_APERTURE_TIME2 \
        << SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos) \
        | (DETECTOR_ADC_CFG0_APERTURE_TIME3 \
        << SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos))

/* Enable soc pin if used */
#define DETECTOR_ADC_CFG0_DSI_TRIGGER_EN_INIT \
        (DETECTOR_ADC_CFG0_USE_SOC \
        << SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_Pos)

/* Set soc operation to edge or level based on sample mode */
#if(DETECTOR_ADC_CFG0_FREERUNNING == DETECTOR_ADC_FREERUNNING)
    #define DETECTOR_ADC_CFG0_DSI_TRIGGER_LEVEL_INIT    (SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_Msk)
#else /* Edge trigger */
    #define DETECTOR_ADC_CFG0_DSI_TRIGGER_LEVEL_INIT    (0u)
#endif /* End DETECTOR_ADC_CFG0_FREERUNNING == DETECTOR_ADC_FREERUNNING */

/* Set SE_NEG_INPUT */
#if(DETECTOR_ADC_CFG0_VNEG_INPUT_SEL == DETECTOR_ADC_NEG_SEL_VSSA_KELVIN)
    #define DETECTOR_ADC_CFG0_SE_NEG_INPUT_INIT \
            ((uint32)(DETECTOR_ADC_NEG_SEL_VSSA_KELVIN \
            << SAR_CTRL_NEG_SEL_Pos ))
#elif(DETECTOR_ADC_CFG0_VNEG_INPUT_SEL == DETECTOR_ADC_NEG_SEL_VREF)

    /* Do not connect VNEG to VREF when one channel in differential mode used */
    /* Only needed for config 0 since 2+ configs == 2+ channels */
    #if((DETECTOR_ADC_CFG0_CHANNEL_COUNT == 1u) && (DETECTOR_ADC_CFG0_SINGLE_PRESENT == 0u))
        #define DETECTOR_ADC_CFG0_SE_NEG_INPUT_INIT     0u
    #else    /* multiple channels or one single channel */
        #define DETECTOR_ADC_CFG0_SE_NEG_INPUT_INIT     (DETECTOR_ADC_NEG_SEL_VREF \
                                                            << SAR_CTRL_NEG_SEL_Pos )
    #endif /* (DETECTOR_ADC_CFG0_CHANNEL_COUNT == 1u) && (DETECTOR_ADC_CFG0_CHANNELS_MODE != 0u) */
#elif (DETECTOR_ADC_CFG0_SINGLE_PRESENT != 0u)
    #define DETECTOR_ADC_CFG0_SE_NEG_INPUT_INIT         DETECTOR_ADC_CFG0_NEG_OTHER
#else
    #define DETECTOR_ADC_CFG0_SE_NEG_INPUT_INIT         0u
#endif /* DETECTOR_ADC_CFG0_VNEG_INPUT_SEL == DETECTOR_ADC_NEG_SEL_VSSA_KELVIN */

#if(DETECTOR_ADC_TOTAL_CHANNELS_NUM > 1u)
    #define DETECTOR_ADC_CFG0_NEG_OTHER                 (uint16)((uint16)DETECTOR_ADC_SARMUX__VNEG0 << SAR_CTRL_NEG_SEL_Pos)
    #define DETECTOR_ADC_CFG0_SWITCH_CONF_INIT          0u
#else /* Disable SAR sequencer from enabling routing switches in single channel mode */
    #define DETECTOR_ADC_CFG0_SWITCH_CONF_INIT          SAR_CTRL_SWITCH_DISABLE_Msk
    #define DETECTOR_ADC_CFG0_NEG_OTHER                 0u
#endif /* DETECTOR_ADC_CFG0_CHANNEL_COUNT > 1u */

/* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
#if(DETECTOR_ADC_TOTAL_CHANNELS_NUM == 1u)
    #define DETECTOR_ADC_CFG0_HW_CTRL_NEGVREF_INIT      0u
#else
    #define DETECTOR_ADC_CFG0_HW_CTRL_NEGVREF_INIT      SAR_CTRL_SAR_HW_CTRL_NEGVREF_Msk
#endif /* DETECTOR_ADC_CFG0_CHANNEL_COUNT == 1u */

