RASC186/lock-in-fw/Lock_in.cydsn/Generated_Source/PSoC6/DETECTOR_ADC.h
/******************************************************************************
* Function Name: DETECTOR_ADC_Enable
****************************************************************************//*
*
* \brief Enables the component.
*
* \param None
*
* \return None
*
* \sideeffect
*  None
*
*******************************************************************************/
__STATIC_INLINE void DETECTOR_ADC_Enable(void)
{
    Cy_SAR_Enable(DETECTOR_ADC_SAR__HW);
}

/*******************************************************************************
* Function Name: DETECTOR_ADC_Stop
****************************************************************************//**
*
* \brief This function stops ADC conversions and puts the ADC into its lowest
* power mode.
*
* \param None
*
* \return None
*
* \sideeffect
* Do not use the DETECTOR_ADC_Stop() API to halt conversions. Instead use the
* DETECTOR_ADC_StopConvert() API. If you use the DETECTOR_ADC_Stop() API
* to halt conversions then later use the DETECTOR_ADC_Start() and
* DETECTOR_ADC_StartConvert() APIs to resume conversions, the first channel
* of the scan may be corrupt. The DETECTOR_ADC_StopConvert() API will enable
* the DETECTOR_ADC to complete the current scan of channels. After the
* channel scan is complete, the DETECTOR_ADC will stop all conversions, which
* can be detected by the use of an ISR or the DETECTOR_ADC_IsEndConversion()
* function.
*
*******************************************************************************/
__STATIC_INLINE void DETECTOR_ADC_Stop(void)
{
    Cy_SAR_Disable(DETECTOR_ADC_SAR__HW);
}

/*******************************************************************************
* Function Name: DETECTOR_ADC_StopConvert
****************************************************************************//**
*
* \brief Forces the DETECTOR_ADC to stop conversions. If a conversion is
* currently executing, that conversion will complete, but no further conversions
* will occur.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void DETECTOR_ADC_StopConvert(void)
{
    Cy_SAR_StopConvert(DETECTOR_ADC_SAR__HW);
}

/*******************************************************************************
* Function Name: DETECTOR_ADC_GetResult16
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register
*
* \param chan The DETECTOR_ADC channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 16-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int16_t DETECTOR_ADC_GetResult16(uint32_t chan)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < DETECTOR_ADC_allConfigs[DETECTOR_ADC_currentConfig].numChannels);

    return Cy_SAR_GetResult16(DETECTOR_ADC_SAR__HW, chan);
}

/*******************************************************************************
* Function Name: DETECTOR_ADC_GetResult32
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register.
*
* \param chan The DETECTOR_ADC channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 32-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int32_t DETECTOR_ADC_GetResult32(uint32_t chan)
{
    int32_t finalResult;

    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < DETECTOR_ADC_allConfigs[DETECTOR_ADC_currentConfig].numChannels);

    finalResult = Cy_SAR_GetResult32(DETECTOR_ADC_SAR__HW, chan);

    return finalResult;
}

/*******************************************************************************
* Function Name: DETECTOR_ADC_SetLowLimit
****************************************************************************//**
*
* \brief Sets the low limit parameter for a limit condition.
*
* \param lowLimit The low limit for a limit condition.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void DETECTOR_ADC_SetLowLimit(uint32_t lowLimit)
{
    Cy_SAR_SetLowLimit(DETECTOR_ADC_SAR__HW, lowLimit);
}

/*******************************************************************************
* Function Name: DETECTOR_ADC_SetHighLimit
****************************************************************************//**
*
* \brief Sets the high limit parameter for a limit condition.
*
* \param highLimit The high limit for a limit condition.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void DETECTOR_ADC_SetHighLimit(uint32_t highLimit)
{
    Cy_SAR_SetHighLimit(DETECTOR_ADC_SAR__HW, highLimit);
}

/*******************************************************************************
* Function Name: DETECTOR_ADC_SetLimitMask
****************************************************************************//**
*
* \brief Sets the channel limit condition mask.
*
*
* \param limitMask
* Sets which channels can cause a limit condition interrupt.
* Bit N of the mask enables the limit condition interrupt for channel N.
* The limitMask cannot be larger than the number of channels.
* If a channel is not enabled, it cannot cause any interrupts.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void DETECTOR_ADC_SetLimitMask(uint32_t limitMask)
{
    Cy_SAR_SetRangeInterruptMask(DETECTOR_ADC_SAR__HW, limitMask);
}

/*******************************************************************************
* Function Name: DETECTOR_ADC_SetSatMask
****************************************************************************//**
*
* \brief Sets the channel saturation event mask.
*
* \param satMask
* Sets which channels can cause a saturation event interrupt.
* Bit N of the mask enables the saturation event interrupt for channel N.
* The satMask cannot be larger than the number of channels.
* If a channel is not enabled, it cannot cause any interrupts.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void DETECTOR_ADC_SetSatMask(uint32_t satMask)
{
    Cy_SAR_SetSatInterruptMask(DETECTOR_ADC_SAR__HW, satMask);
}

