RASC186/lock-in-fw/Lock_in.cydsn/Generated_Source/PSoC6/DETECTOR_ADC.h
/*******************************************************************************
* Function Name: DETECTOR_ADC_CountsTo_uVolts
****************************************************************************//**
*
* \brief Converts the ADC output to microvolts as an int32. For example, if the ADC
* measured 0.534 volts, the return value would be 534000.
* The calculation of voltage depends on the contents of Cy_SAR_offset[],
* Cy_SAR_countsPer10Volt[], and other parameters.  The equation used is:
*
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* -Counts = Raw Counts from SAR register
* -AvgDivider = divider based on averaging mode
*     -Sequential, Sum: AvgDivider = number averaged
*         Note: The divider should be a maximum of 16. If using more averages,
*         pre-scale Counts by (number averaged / 16)
*     -Interleaved, Sum: AvgDivider = number averaged
*     -Sequential, Fixed: AvgDivider = 1
* -Offset = Cy_SAR_offset[]
* -TEN_VOLT = 10V constant and unit scalar.
* -Gain = Cy_SAR_countsPer10Volt[]
*
* When the Vref is based on Vdda, the value used for Vdda is set for the project
* in the System tab of the DWR.
*
* \param chan DETECTOR_ADC channel number.
*
* \param adcCounts Result from the DETECTOR_ADC conversion.
*
* \return Result in microvolts.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int32_t DETECTOR_ADC_CountsTo_uVolts(uint32_t chan, int16_t adcCounts)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < DETECTOR_ADC_allConfigs[DETECTOR_ADC_currentConfig].numChannels);

    return Cy_SAR_CountsTo_uVolts(DETECTOR_ADC_SAR__HW, chan, adcCounts);
}

/*******************************************************************************
* Function Name: DETECTOR_ADC_Sleep
****************************************************************************//**
*
* \brief This is the preferred routine to prepare the component for sleep. The
* DETECTOR_ADC_Sleep() routine saves the current component state. Then it
* calls the DETECTOR_ADC_Stop() function.
*
* Calling this routine directly is not needed.
* The DETECTOR_ADC_DeepSleepCallbackStruct will ensure this routine
* is called before the device enters Deep Sleep mode.
*
* \param None
*
* \return None
*
* \sideeffect If this function is called twice in the enable state of the
* component, the disabled state of the component will be stored. So
* DETECTOR_ADC_Enable() and DETECTOR_ADC_StartConvert() must be called
* after DETECTOR_ADC_Wakeup() in this case.
*
* \globalvars
*  \ref DETECTOR_ADC_backup (W)
*
* \globalvars
*  \ref DETECTOR_ADC_backup
*
*******************************************************************************/
__STATIC_INLINE void DETECTOR_ADC_Sleep(void)
{
    Cy_SAR_Sleep(DETECTOR_ADC_SAR__HW);
}


/*******************************************************************************
* Function Name: DETECTOR_ADC_Wakeup
****************************************************************************//**
*
* \brief This is the preferred routine to restore the component to the state when
* DETECTOR_ADC_Sleep() was called.
* If the component was enabled before the DETECTOR_ADC_Sleep()
* function was called, the DETECTOR_ADC_Wakeup() function also re-enables the
* component.
*
* Calling this routine directly is not needed.
* The DETECTOR_ADC_DeepSleepCallbackStruct will ensure this routine
* is called after the device wakes up from Deep Sleep mode.
*
* \param None
*
* \return None
*
* \sideeffect
* Calling this function without previously calling DETECTOR_ADC_Sleep() may lead to
* unpredictable results.
*
* \globalvars
*  \ref DETECTOR_ADC_backup (R)
*
* \globalvars
*  \ref DETECTOR_ADC_backup
*
*******************************************************************************/
__STATIC_INLINE void DETECTOR_ADC_Wakeup(void)
{
    Cy_SAR_Wakeup(DETECTOR_ADC_SAR__HW);
}

#endif /* !defined(CY_DETECTOR_ADC_H) */

/* [] END OF FILE */
